recipe = {
"Колбаса копченая" : 100,
"Сыр твердый":  100,
"Яйца вареные":  3,
"Кукуруза консервированная": 140,
"Чеснок": 1,
"Майонез": 80}
list_products = {"Колбаса копченая" : 500,
"Сыр твердый":  50,
"Яйца вареные":  1,
"Кукуруза консервированная": 40,
"Чеснок": 5,
"Майонез": 180,
"Лук": 5,
"Помидоры": 10}
success = str()
for i in recipe.items():
    for x in list_products.items():
        if i[0] == x[0]:
            if x[1] < i[1]:
                success += x[0]
                success += " "
if success == str():
    print("Ничего не нужно")
else:
    print(f"Нужно купить {success}")
